In [1]:
import pandas as pd
import scipy.stats as stats

In [2]:
data=pd.read_csv("Advertising.csv")
data.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

# 1. Explain the dataset

In [3]:
data.describe()

       Unnamed: 0          TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000  200.000000
mean   100.500000  147.042500   23.264000   30.554000   14.022500
std     57.879185   85.854236   14.846809   21.778621    5.217457
min      1.000000    0.700000    0.000000    0.300000    1.600000
25%     50.750000   74.375000    9.975000   12.750000   10.375000
50%    100.500000  149.750000   22.900000   25.750000   12.900000
75%    150.250000  218.825000   36.525000   45.100000   17.400000
max    200.000000  296.400000   49.600000  114.000000   27.000000

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [5]:
len(data)

200

In [6]:
data.shape

(200, 5)

In [7]:
data.isna().sum()

Unnamed: 0    0
TV            0
Radio         0
Newspaper     0
Sales         0
dtype: int64

Given Data set contain 200 columns and 5 rows and there is no values in the data set. Unnamed column indicate the index hence the data types is integer and the remaining column values are in float data type.

# 2. Check the summary statistics and discuss the max, min, avg, median, and percentiles.

In [8]:
data[['TV', 'Radio', 'Newspaper','Sales']].describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

Max amount is spend for TV ad ie,296.400000
Min amount is spend for Radio ad ie,0.000000

# 3.The manager wants to find out whether the same amount was spent for the three advertisements (TV , Radio and Newspaper). Comment on your findings

In [9]:
#ANOVA TEST

#H0 : Amount spend for all three advertisements are the same
#H1 : Amount spend for three advertisement are different

In [10]:
fvalue,pvalue = stats.f_oneway(data['TV'],data['Radio'],data['Newspaper'])
print( 'fvalue : ',fvalue,'pvalue : ',pvalue)

fvalue :  358.8514595342597 pvalue :  4.552931539744962e-103

level of significance (alpha) = 0.05 (5%)

p value< 0.05 and hence we have the evidence to reject the null hypothesis accept alternative hypothesis 
ie, the amount spend for each three advertisement are different.